app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = session[:user_id]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "diyitiao"], ["created_at", "2016-11-26 07:13:10.549741"], ["updated_at", "2016-11-26 07:13:10.549741"]]