app/controllers/users_controller.rb

  def create
    @user = User.new(users_params)
    if @user.save
---
INSERT INTO "users" ("userName", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)